app/views/books/_form.html.erb

    <%= form.text_field :author_id %></br></br>
    <%= form.collection_check_boxes(:author_ids, Author.all, :id, :fullname, checked: book.authors.map(&:id)) do |b| %>
---
SELECT "authors"."id" FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 2]]