app/views/books/index.html.erb

  <div>
    <%= form.collection_select :user_id, User.all, :id, :name, {:prompt => 'Please select user for this book loan'} %>
---
SELECT "users".* FROM "users"


        <td><%= book.authors.map(&:fullname).join(';') %></td>
---
SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]


              <%= check_box_tag "loan[book_ids][]", book.id, @loan.books.include?(book), {:id => dom_id(book, dom_id(@loan)) } %>
---
SELECT "books".* FROM "books"