app/views/books/show.html.erb

  <strong>Authors:</strong></br>
  <%= @book.authors.map(&:fullname).join(';') %>
---
SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]