app/views/loans/index.html.erb

        <td><%= loan.confirmed %></td>
        <td><%= loan.books.map(&:title).join(',') %></td>
---
SELECT "books".* FROM "books" INNER JOIN "loan_items" ON "books"."id" = "loan_items"."book_id" WHERE "loan_items"."loan_id" = ?  [["loan_id", 1]]