app/views/loans/show.html.erb

  <strong>Books:</strong></br>
    <% @loan.books.each do |book| %>
---
SELECT "books".* FROM "books" INNER JOIN "loan_items" ON "books"."id" = "loan_items"."book_id" WHERE "loan_items"."loan_id" = ?  [["loan_id", 1]]