app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT "authors".* FROM "authors"