app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "isbn13", "description", "coverimage", "instock_total", "instock_now", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "instock_total" = ?, "instock_now" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["instock_total", 2], ["instock_now", 1], ["updated_at", "2019-06-18 08:58:04.389627"], ["id", 3]]
---
  def update
    #params[:book][:author_ids] ||=[]
    respond_to do |format|
      if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])