app/controllers/loans_controller.rb

SELECT "loans".* FROM "loans"
---
  def index
    @loans = Loan.all

INSERT INTO "loans" ("date_loaned", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date_loaned", "2019-06-17"], ["user_id", 2], ["created_at", "2019-06-17 07:37:14.245585"], ["updated_at", "2019-06-17 07:37:14.245585"]]
---
  def create
    @loan = Loan.new(loan_params)

    respond_to do |format|
      if @loan.save

DELETE FROM "loans" WHERE "loans"."id" = ?  [["id", 3]]
---
  def destroy
    @loan.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "instock_now" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["instock_now", 0], ["updated_at", "2019-06-17 21:24:58.825683"], ["id", 2]]
---
    def decrease_book_quantities(books)
      books.each do |loaned|
        b = Book.find(loaned.id)
        b.instock_now -= 1
        b.save

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_loan
      @loan = Loan.find(params[:id])